{
  "pt-BR": {
    "commands": {
      "configs": {
        "terms": {  
          "name": "termos", 
          "description": "Você pode aceitar os termos do bot e usar todos os comandos!"
        }
      },
      "informations": {
        "link": {
          "name": "link", 
          "description": "Você pode ver o link para alguma página dos fundadores.", 
          "github_name": "github", 
          "github_description": "Mostra o link para o github dos fundadores.", 
          "lucas_christian": "Você pode ver o github público do LordLuch clicando [aqui]([github])!", 
          "lordluch": "Você pode ver o github secundário do LordLuch clicando [aqui]([github])!", 
          "kyuno": "Você pode ver o github do Kyuno em: https://github.com/Ovatsugh"
        },
        "help": {
          "name": "ajuda",
          "description": "Mostra informações sobre comandos, sobre o bot, etc...",
          "command_name": "comandos",
          "command_description": "Mostra os comandos de uma determinada categoria.",
          "informations": "Os comandos informativos podem ser vistos em: albot.vercel.app",
          "administration": "Os comandos administrativos podem ser vistos em: albot.vercel.app"
        }
      },
      "owner": {
        "reload": {
          "name": "recarregar",
          "description": "Recarrega os comandos do bot."
        }
      }
    },
    "events": {
      "interactionCreate": {
        "not_allowed_in_dm": "Esse comando não é permitido em DM!",
        "member_without_permissions": "Você não tem as permissões necessárias para executar esse comando!",
        "albot_without_permissions": "Eu não tenho as permissões necessárias para executar esse comando!",
        "is_not_owner": "Esse é um comando de nível owner, e você não tem acesso!",
        "failed_to_run": "Falha ao executar o comando!",
        "doNotAcceptedTerms": "<@[userID]> Você ainda não aceitou os termos e os comandos que utilizam database não serão executados, você pode aceitar os termos a qualquer momento com o comando /termos!",
        "youAreBanned": "Você está banido, e não poderá mais executar comandos!"
      }
    },
    "errors": {
      "bot_without_perms": "O bot não tem permissões as permissões necessárias para executar este comando."
    }
  },
  "en-US": {
    "commands": {
      "configs": {
        "terms": {
          "name": "terms",
          "description": "You can accept the terms of the bot, and use all commands!"
        }
      },
      "informations": {
        "link": {
          "name": "link", 
          "description": "You can see the link to some page of the founders.", 
          "github_name": "github", 
          "github_description": "Shows the link to the founders github.", 
          "lucas_christian": "You can see LordLuch's public github by clicking [here]([github])!", 
          "lordluch": "You can see LordLuch's secondary github by clicking [here]([github])!", 
          "kyuno": "You can see Kyuno's github at: https://github.com/Ovatsugh"
        },
        "help": {
          "name": "help",
          "description": "Shows information about commands, about the bot, etc...",
          "command_name": "commands",
          "command_description": "Shows commands of a certain category.",
          "informations": "Informational commands can be seen at: albot.vercel.app",
          "administration": "Administrative commands can be seen at: albot.vercel.app"
        }
      },
      "owner": {
        "reload": {
          "name": "reload",
          "description": "Reload bot commands."
        }
      }
    },
    "events": {
      "interactionCreate": {
        "not_allowed_in_dm": "This command is not allowed in DM!",
        "member_without_permissions": "You don't have the necessary permissions to run this command!",
        "albot_without_permissions": "I don't have the necessary permissions to run this command!",
        "is_not_owner": "This is an owner-level command, and you don't have access!",
        "failed_to_run": "Failed to execute command!",
        "doNotAcceptedTerms": "<@[userID]> You have not yet accepted the terms and commands that use database will not be executed, you can accept the terms at any time with the command /terms!",
        "youAreBanned": "You are banned, and will no longer be able to execute commands!"
      }
    },
    "errors": {
      "bot_without_perms": "The bot does not have the permissions required to run this command."
    }
  }
}
